EDT/УТ/src/Reports/ДинамикаРостаБД/ДинамикаРостаБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДинамикаРостаБД</name>
  <attributes>
    <name>ФлагСправочники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВМегабайтах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагАДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагТехно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ADODBProvider</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоАДО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицыБД</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТаблицыХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерЗаписи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаписей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеБД</name>
    <attributes>
      <name>ГГГГММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ММ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерЗаписи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пример</name>
  </tabularSections>
</mdclass:Report>

EDT/УТ/src/Reports/ДинамикаРостаБД/ObjectModule.bsl
Перем ТекДата;
Перем мФлагАДО Экспорт;

Функция ДатаСозданияСсылки(Тынц) Экспорт
	Возврат ДатаСозданияГУИД(Тынц.УникальныйИдентификатор());
КонецФункции

Функция ДатаСозданияГУИД(ГУИД)
    Строка16 = Сред(ГУИД, 16, 3) + Сред(ГУИД, 10, 4) + Сред(ГУИД, 1, 8);
    ЧислоСек = 0;
    Для Позиция = 1 По СтрДлина(Строка16) Цикл
        ЧислоСек = ЧислоСек + Найти("123456789abcdef", Сред(Строка16, Позиция, 1))*Pow(16, СтрДлина(Строка16) - Позиция);
    КонецЦикла;
    Возврат Дата(1582, 10, 15, 04, 00, 00) + ЧислоСек / 10000000;
КонецФункции

Функция Из_10_В_Любую(Знач Значение=0, Нотация=16)
	Результат = "";
	Если Нотация > 0 Тогда
		Значение = Число(Значение);
		Если Значение <= 0 Тогда
			Результат = "00";
		Иначе
			Значение = Цел(Значение);
			Пока Значение > 0 Цикл
				Результат = Сред("0123456789abcdefghijklmnopqrstuvwxyz", Значение%Нотация + 1, 1) + Результат;
				Значение = Цел(Значение/Нотация);
			КонецЦикла;
			Результат = ?(СтрДлина(Результат)=1, "0" + Результат, Результат);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
 КонецФункции
 
Функция ПолучитьGUIDизCOMSafeArray(COMSafeArray)
	МассивGuid = COMSafeArray.Выгрузить();
	GUIDСсылки = "";
	Для н=12 по 15 Цикл
		GUIDСсылки = GUIDСсылки + Из_10_В_Любую(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	Для н=10 по 11 Цикл
		GUIDСсылки = GUIDСсылки + Из_10_В_Любую(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	Для н=8 по 9 Цикл
		GUIDСсылки = GUIDСсылки + Из_10_В_Любую(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	Для н=0 по 1 Цикл
		GUIDСсылки = GUIDСсылки + Из_10_В_Любую(МассивGuid[н]);
	КонецЦикла;
	GUIDСсылки = GUIDСсылки + "-";
	Для н=2 по 7 Цикл
		GUIDСсылки = GUIDСсылки + Из_10_В_Любую(МассивGuid[н]);
	КонецЦикла;
	Возврат Новый УникальныйИдентификатор(GUIDСсылки);
КонецФункции

Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Разделитель = ";")
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Строка = СокрЛП(Строка);
		Пока Истина Цикл
			Поз = Найти(Строка, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Строка);
				Прервать;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Строка, Поз - 1));
			Строка = СокрЛ(Сред(Строка, Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока Истина Цикл
			Поз = Найти(Строка, Разделитель);
			Если Поз = 0 Тогда
				МассивСтрок.Добавить(Строка);
				Прервать;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Строка, Поз - 1));
			Строка = Сред(Строка, Поз + ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	Возврат МассивСтрок;
КонецФункции

Функция ВыделитьПараметр(МассивСтрок, Знач ПодстрокаПоиска) Экспорт
	Ответ = "";
	Для Каждого тЭлемент Из МассивСтрок Цикл
		Строка = СтрЗаменить(СтрЗаменить(СтрЗаменить(тЭлемент, " ", ""), "=", ""), """", "");
		Если НРег(Лев(Строка, СтрДлина(ПодстрокаПоиска))) = НРег(ПодстрокаПоиска) Тогда
			Ответ = Сред(Строка, СтрДлина(ПодстрокаПоиска) + 1);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Процедура ТаблицыХраненияСортировать(ТаблицыХранения)
	ТаблицыХранения.Колонки.Добавить("Порядок");
	Для Каждого тСтрока Из ТаблицыХранения Цикл
		тСтрока.Порядок = ?(ПустаяСтрока(тСтрока.ИмяТаблицы), "яя", тСтрока.ИмяТаблицы) + тСтрока.ИмяТаблицыХранения;
	КонецЦикла;
	ТаблицыХранения.Сортировать("Порядок");
КонецПроцедуры

Процедура Инициализация(Соединение)
	ТекДата = ТекущаяДата();
	Если мФлагАДО <> ФлагАДО Тогда
		СтрПодключения = РазложитьСтрокуВМассивПодстрок(НРег(СтрокаСоединенияИнформационнойБазы()));
		мСервер = ВыделитьПараметр(СтрПодключения, "srvr");
		Если Не ПустаяСтрока(мСервер) Тогда
			мБаза = ВыделитьПараметр(СтрПодключения, "ref");
		КонецЕсли;
		Если ФлагАДО И ПустаяСтрока(мСервер) Или ПустаяСтрока(мБаза) Тогда
			ФлагАДО = Ложь;
		КонецЕсли;

		мФлагАДО = ФлагАДО;
		ТаблицыХранения = ПолучитьСтруктуруХраненияБазыДанных(, Истина);
		ТаблицыХраненияСортировать(ТаблицыХранения);
		ТаблицыБД.Очистить();
		Для Каждого тСтрока Из ТаблицыХранения Цикл
			текСтрока = ТаблицыБД.Добавить();
			ЗаполнитьЗначенияСвойств(текСтрока, тСтрока);
			Если ПустаяСтрока(текСтрока.ИмяТаблицы) Тогда
				текСтрока.ИмяТаблицы = тСтрока.Метаданные;
			КонецЕсли;
			
			Если Прав(тСтрока.ИмяТаблицы, 10) = ".Изменения" Тогда
				текСтрока.Тип = -117;
			ИначеЕсли Лев(тСтрока.Назначение, 4) = "Иниц" И НЕ ФлагТехно Тогда
				Продолжить;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 3) = "Док" Тогда
				текСтрока.Тип	= ?(СтрЧислоВхождений(тСтрока.ИмяТаблицы, ".") = 1, 1, 2);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 3) = "Спр" Тогда
				текСтрока.Тип	= ?(тСтрока.Назначение="Основная", 15, -115);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "РегистрНак" Тогда
				текСтрока.Тип	= 7;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "РегистрБух" Тогда
				текСтрока.Тип	= 8;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "РегистрСве" Тогда
				Если СтрЧислоВхождений(тСтрока.ИмяТаблицы, ".")=1 Тогда
					текСтрока.Тип	= ?(Метаданные.РегистрыСведений[Сред(тСтрока.ИмяТаблицы, Найти(тСтрока.ИмяТаблицы, ".")+1)].ПериодичностьРегистраСведений=Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический, -111, 11);
				КонецЕсли;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "РегистрРас" Тогда
				текСтрока.Тип	= ?(СтрЧислоВхождений(тСтрока.ИмяТаблицы, ".") = 1, 9, -109);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 3) = "Зад" Тогда
				текСтрока.Тип	= ?(СтрЧислоВхождений(тСтрока.ИмяТаблицы, ".") = 1, 3, 4);
			//ИначеЕсли Лев(тСтрока.Назначение, 6) = "ТочкаМ" Тогда
			//	текСтрока.Тип	= -36;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 3) = "Биз" Тогда
				текСтрока.Тип	= ?(СтрЧислоВхождений(текСтрока.ИмяТаблицы, ".") = 1, 6, -36);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 3) = "Жур" Тогда
				текСтрока.Тип	= 5;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 3) = "Пос" Тогда
				текСтрока.Тип	= 17;
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "ПланСчетов" Тогда
				текСтрока.Тип	= ?(тСтрока.Назначение = "Основная", 22, -122);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "ПланВидовХ" Тогда
				текСтрока.Тип	= ?(тСтрока.Назначение = "Основная", 23, -123);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "ПланВидовР" Тогда
				текСтрока.Тип	= ?(тСтрока.Назначение = "Основная", 24, -124);
			ИначеЕсли Лев(тСтрока.ИмяТаблицы, 10) = "ПланОбмена." Тогда
				текСтрока.Тип	= ?(тСтрока.Назначение = "Основная", 25, -125);
				
			ИначеЕсли ФлагАДО Тогда
				Если тСтрока.Назначение = "ГраницыПоследовательности" Тогда
					текСтрока.Тип = -18;
				ИначеЕсли тСтрока.Назначение = "РегистрацияИзменений" Тогда
					текСтрока.Тип	= -117;
				ИначеЕсли тСтрока.Поля.Найти("_Period", "ИмяПоляХранения") <> Неопределено Тогда
					текСтрока.Тип = ?(тСтрока.Назначение = "РегистрацияИзменений", -117, 18);
				ИначеЕсли тСтрока.Поля.Найти("_NodeRRef", "ИмяПоляХранения") <> Неопределено Тогда
					текСтрока.Тип = 19;
				ИначеЕсли тСтрока.Назначение = "ИсторияРаботыПользователей" Тогда
					текСтрока.Тип = 119;
				КонецЕсли;
			КонецЕсли;
			
			Если текСтрока.Тип = 0 Тогда
				Если НЕ ФлагТехно Тогда
					Продолжить;
				ИначеЕсли ФлагАДО Тогда
					текСтрока.РазмерЗаписи = ПолучитьРазмерТаблицы(тСтрока, Соединение);
				КонецЕсли;
			ИначеЕсли Лев(тСтрока.Назначение, 20) = "РегистрацияИзменений" И НЕ ФлагТехно Тогда
				текСтрока.Тип = 0;
				Продолжить;
			Иначе
				Если ФлагАДО Тогда
					текСтрока.РазмерЗаписи = ПолучитьРазмерТаблицы(тСтрока, Соединение);
				КонецЕсли;
				Если ?(ФлагАДО, текСтрока.Тип <> 0 И текСтрока.Тип > -100, текСтрока.Тип > 0) Тогда
					Если НЕ ФлагАДО Тогда
						Для Каждого СтрокаПоляХранения Из тСтрока.Поля Цикл
							Размер = ПолучитьРазмерПоля(тСтрока, СтрокаПоляХранения);
							Если Размер > 0 Тогда
								текСтрока.РазмерЗаписи = текСтрока.РазмерЗаписи + Размер;
								текСтрока.РазмерЗаписи = текСтрока.РазмерЗаписи + ПолучитьРазмерИндекса(тСтрока, СтрокаПоляХранения.ИмяПоляХранения, Размер);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			текСтрока.КоличествоЗаписей = ПолучитьКоличествоЗаписей(текСтрока, Соединение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция СоединениеПолучить() Экспорт
	Соединение = Неопределено;
	Если ФлагАДО Тогда
		СтрПодключения = РазложитьСтрокуВМассивПодстрок(НРег(СтрокаСоединенияИнформационнойБазы()));
		мСервер = ВыделитьПараметр(СтрПодключения, "srvr");
		Если Не ПустаяСтрока(мСервер) Тогда
			мБаза = ВыделитьПараметр(СтрПодключения, "ref");
		КонецЕсли;
		Если ФлагАДО И ПустаяСтрока(мСервер) Или ПустаяСтрока(мБаза) Тогда
			ФлагАДО = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если ФлагАДО Тогда
		СтрПодключения = "Provider=" + ?(ПустаяСтрока(ADODBProvider), "SQLOLEDB.1", ADODBProvider) + ";server=" + мСервер + ";database=" + мБаза;
		Если НЕ ПустаяСтрока(Пользователь) Тогда
			СтрПодключения = СтрПодключения + ";uid=" + Пользователь + ";pwd=" + Пароль;
		КонецЕсли;
	    Соединение = Новый COMОбъект("ADODB.Connection");
	    Соединение.ConnectionString = СтрПодключения;
		//Соединение.CommandTimeout = 600;
		Попытка
			Соединение.Open();
		Исключение
			Сообщить(ОписаниеОшибки());
			Соединение	= Неопределено;
			ФлагАДО		= Ложь;
		КонецПопытки;
	КонецЕсли;
	Возврат Соединение;
КонецФункции

Функция Запросить(Знач ТекстЗапроса, Соединение=Неопределено) Экспорт
	Выборка = Неопределено;
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		Если Соединение = Неопределено Тогда
			Соединение = СоединениеПолучить();
		КонецЕсли;
		Если Соединение = Неопределено Тогда
			ФлагАДО = Ложь;
		Иначе
			Запрос = Новый COMОбъект("ADODB.Command");
			Запрос.ActiveConnection = Соединение;
			Попытка
				Запрос.CommandText = ТекстЗапроса;
				Выборка = Новый COMОбъект("ADODB.Recordset");
				Выборка.ActiveConnection = Соединение;
				Выборка.Open(Запрос.Execute(ТекстЗапроса));
			Исключение
				Выборка = Неопределено;
				Сообщить(ОписаниеОшибки() + "	" + ТекстЗапроса);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Выборка;
КонецФункции

Функция ПолучитьРазмерТаблицы(Знач тСтрока, Соединение)
	Размер = 0;
	Выборка = Запросить("SELECT * FROM " + тСтрока.ИмяТаблицыХранения + " WHERE 0=1", Соединение);
	Если Выборка <> Неопределено Тогда
		Для Каждого ТекПоле Из Выборка.Fields Цикл
			Если ТекПоле.DefinedSize > 1000 Тогда
				Размер = Размер + ?(ТекПоле.NumericScale=255, 0, ТекПоле.NumericScale);
			Иначе
				Размер = Размер + ТекПоле.DefinedSize;
				Размер = Размер + ПолучитьРазмерИндекса(тСтрока, ТекПоле.Name, ТекПоле.DefinedSize);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Размер;
КонецФункции

Функция ПолучитьРазмерИндекса(Знач тСтрока, Знач ИмяПоляХранения, Знач РазмерПоля)
	Размер = 0;
	Для Каждого тИндекс Из тСтрока.Индексы Цикл
		Если тИндекс.Поля.Найти(ИмяПоляХранения, "ИмяПоляХранения") <> Неопределено Тогда
			Размер = Размер + РазмерПоля;
		КонецЕсли;
	КонецЦикла;
	Возврат Размер;
КонецФункции

Функция ПолучитьКоличествоЗаписей(Знач тСтрока, Соединение)
	Колво = 0;
	Если ФлагАДО Тогда
		Выборка = Запросить("SELECT COUNT(1) сounter FROM dbo." + тСтрока.ИмяТаблицыХранения, Соединение);
		Если Выборка <> Неопределено И Не Выборка.EOF Тогда
			Колво = Выборка.Fields.Item(0).Value;
		КонецЕсли;
	ИначеЕсли тСтрока.Тип < 18 И Не ПустаяСтрока(тСтрока.ИмяТаблицы) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
								|	КОЛИЧЕСТВО(0) КАК Количество
								|ИЗ
								|	" + тСтрока.ИмяТаблицы + " КАК Таблица");
		Попытка
			Выборка	= Запрос.Выполнить().Выбрать();
			Колво	= ?(Выборка.Следующий(), Выборка.Количество, 0);
		Исключение
			Сообщить("Проблема с определением количества записей: " + тСтрока.ИмяТаблицы);
		КонецПопытки;
	КонецЕсли;
	Возврат Колво;
КонецФункции

Функция Предугадать(Знач ИмяПоляХранения)
	Размер = 0;
	Если Прав(ИмяПоляХранения, 4) = "RRef" Тогда	// Ссылка
		Размер = 16;
	ИначеЕсли Прав(ИмяПоляХранения, 4) = "TRef" Тогда	// Тип ссылки
		Размер = 4;
	ИначеЕсли Прав(ИмяПоляХранения, 5) = "_TYPE" 		// 
		Или Прав(ИмяПоляХранения, 2) = "_L" Тогда		// 
		Размер = 1;
	ИначеЕсли ИмяПоляХранения = "_Marked" Тогда	// Пометка удаления
		Размер = 1;
	ИначеЕсли ИмяПоляХранения = "_Version" Тогда	// Версия данных
		Размер = 8;
	ИначеЕсли ИмяПоляХранения = "_IsMetadata"
		Или ИмяПоляХранения = "_PredefinedObj"
		Или ИмяПоляХранения = "_PredefinedBaseCKTableLine"
		Или ИмяПоляХранения = "_PredefinedLeadingCKTableLine"	// Предопреленный
		Или ИмяПоляХранения = "_DimIsMetadata" 					// Предопределенное
		Или ИмяПоляХранения = "_Predefined" Тогда	// 
		Размер = 1;
	ИначеЕсли Лев(ИмяПоляХранения, 7) = "_LineNo" Тогда	// НомерСтроки 5 9
		Размер = 5;
	ИначеЕсли ИмяПоляХранения = "_KeyField" Тогда	// 
		Размер = 4;
	ИначеЕсли ИмяПоляХранения = "_Period" 			// Период=Дата
		Или ИмяПоляХранения = "_Date_Time" 			// Дата
		Или ИмяПоляХранения = "_NumberPrefix" 		// ДатаВремя
		Или ИмяПоляХранения = "_MinPeriod"
		Или ИмяПоляХранения = "_StartTime"
		Или ИмяПоляХранения = "_FinishTime"
		Или ИмяПоляХранения = "_Date"
		Или Прав(ИмяПоляХранения, 2) = "_T" Тогда	// 
		Размер = 8;
	ИначеЕсли ИмяПоляХранения = "_Folder" Тогда	// ЭтоГруппа
		Размер = 1;
	ИначеЕсли ИмяПоляХранения = "_Active" 				// Активность
		Или ИмяПоляХранения = "_Posted" 				// Проведен
		Или ИмяПоляХранения = "_Executed" 				// Выполнена
		Или ИмяПоляХранения = "_ActualPeriod" Тогда		// 
		Размер = 1;
	ИначеЕсли ИмяПоляХранения = "_BaseCKLineNo"			// НомерСтроки
		Или ИмяПоляХранения = "_LeadingCKLineNo" 		// НомерСтроки
		Или ИмяПоляХранения = "_RecordKind" Тогда		// ВидСтроки
		Размер = 5;
	ИначеЕсли ИмяПоляХранения = "_EnumOrder" Тогда	// Порядок
		Размер = 10;
	ИначеЕсли ИмяПоляХранения = "_OrderField" Тогда	// Порядок
		Размер = 16;
	ИначеЕсли ИмяПоляХранения = "_Kind" 			// Вид счета
		Или ИмяПоляХранения = "_OffBalance" Тогда	// Забалансовый
		Размер = 1;
	ИначеЕсли ИмяПоляХранения = "_TurnoverOnly" 		// ТолькоОбороты
		Или ИмяПоляХранения = "_Correspond" Тогда		// 
		Размер = 1;
	//ИначеЕсли Лев(ИмяПоляХранения, 9) = "_Turnover" Тогда	// Итоги
	//	Размер = 21;
	ИначеЕсли ИмяПоляХранения = "_Splitter" Тогда	// Разделитель
		Размер = 10;
	ИначеЕсли ИмяПоляХранения = "_ActivationCondition" Тогда	// 
		Размер = 16;
	ИначеЕсли НРег(ИмяПоляХранения) = "_userid" Тогда	// 
		Размер = 64;
	ИначеЕсли ИмяПоляХранения = "_ObjectKey"
		Или ИмяПоляХранения = "_SettingsKey"
		Или ИмяПоляХранения = "_SettingsPresentation" Тогда	//
		Размер = 256;
	ИначеЕсли НРег(ИмяПоляХранения) = "_id" 			// 
		//Или ИмяПоляХранения = "_URL" 					//
		Или ИмяПоляХранения = "_MDObjID" 				//
		Или ИмяПоляХранения = "_ConstID" 				//
		Или ИмяПоляХранения = "_RegID" Тогда			// ГУИД
		Размер = 16;
	ИначеЕсли ИмяПоляХранения = "_MessageNo" Тогда	//
		Размер = 10;
	ИначеЕсли ИмяПоляХранения = "_FileName" Тогда	//
		Размер = 128;
	ИначеЕсли ИмяПоляХранения = "_Periodicity" Тогда	// 
		Размер = 2;
	ИначеЕсли ИмяПоляХранения = "_RepetitionFactor" Тогда	// 
		Размер = 2;
	ИначеЕсли ИмяПоляХранения = "_UseTotals" 		// 
		Или ИмяПоляХранения = "_UseSplitter" 		// 
		Или ИмяПоляХранения = "_Use" Тогда			// 
		Размер = 1;
	ИначеЕсли ИмяПоляХранения = "_Description" 		// Наименование
		Или ИмяПоляХранения = "_JobKey" Тогда		// Ключ
		Размер = 128;
	ИначеЕсли ИмяПоляХранения = "_MetadataID" Тогда	// 
		Размер = 16;
	ИначеЕсли ИмяПоляХранения = "_UserName" Тогда	// 
		Размер = 255;
	ИначеЕсли Лев(ИмяПоляХранения, 8) = "_Restart"
		Или ИмяПоляХранения = "_State"
		Или ИмяПоляХранения = "_Version" Тогда
		Размер = 9;
	ИначеЕсли ИмяПоляХранения = "_SentNo" 			// номер сообщения
		Или ИмяПоляХранения = "_ReceivedNo" Тогда	// номер сообщения
		Размер = 10;
	ИначеЕсли ИмяПоляХранения = "_URLHash" Тогда	// 
		Размер = 10;
	ИначеЕсли ИмяПоляХранения = "_SimpleKey" Тогда	// 
		Размер = 16;
	ИначеЕсли ИмяПоляХранения = "_RecordKey" Тогда	// 
		Размер = 1;
	КонецЕсли;
	Возврат Размер;
КонецФункции

Функция ПолучитьРазмерПоля(СтрокаТаблХранения, СтрокаПоляХранения)
	Размер = 0;
	Мета = "";
	Поле = Неопределено;
	Попытка
		Если Лев(СтрокаТаблХранения.Метаданные, 10) = "Справочник" Тогда
			Мета = "Метаданные.Справочники" + Сред(СтрокаТаблХранения.Метаданные, 11);
			Если СтрокаТаблХранения.Назначение = "ТабличнаяЧасть" Тогда
				Мета = СтрЗаменить(Мета, ".ТабличнаяЧасть.", ".ТабличныеЧасти.");
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаПоляХранения.ИмяПоля) Тогда
				Поле = Вычислить(Мета + ".Реквизиты.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
			КонецЕсли;
		ИначеЕсли Лев(СтрокаТаблХранения.Метаданные, 8) = "Документ" Тогда
			Мета = "Метаданные.Документы" + Сред(СтрокаТаблХранения.Метаданные, 9);
			Если СтрокаТаблХранения.Назначение = "ТабличнаяЧасть" Тогда
				Мета = СтрЗаменить(Мета, ".ТабличнаяЧасть.", ".ТабличныеЧасти.");
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаПоляХранения.ИмяПоля) Тогда
				Поле = Вычислить(Мета + ".Реквизиты.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
			КонецЕсли;
		ИначеЕсли Лев(СтрокаТаблХранения.Метаданные, 7) = "Регистр" Тогда
			Мета = "Метаданные.Регистры" + Сред(СтрокаТаблХранения.Метаданные, 8);
			Если Не ПустаяСтрока(СтрокаПоляХранения.ИмяПоля) Тогда
				Поле = Вычислить(Мета + ".Измерения.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
				Если Поле = Неопределено Тогда
					Поле = Вычислить(Мета + ".Ресурсы.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
					Если Поле = Неопределено Тогда
						Поле = Вычислить(Мета + ".Реквизиты.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
						Если Поле = Неопределено И Лев(СтрокаТаблХранения.Метаданные, 10) = "РегистрБух"
							И (Прав(СтрокаПоляХранения.ИмяПоляХранения, 2) = "Dt" Или Прав(СтрокаПоляХранения.ИмяПоляХранения, 2) = "Ct") Тогда
							Поле = Вычислить(Мета + ".Ресурсы.Найти(""" + Лев(СтрокаПоляХранения.ИмяПоля, СтрДлина(СтрокаПоляХранения.ИмяПоля)-2) + """)");
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Лев(СтрокаТаблХранения.Метаданные, 16) = "ЖурналДокументов" Тогда
			Мета = "Метаданные.ЖурналыДокументов" + Сред(СтрокаТаблХранения.Метаданные, 17);
			Если Не ПустаяСтрока(СтрокаПоляХранения.ИмяПоля) Тогда
				Поле = Вычислить(Мета + ".Графы.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
			КонецЕсли;
		ИначеЕсли Лев(СтрокаТаблХранения.Метаданные, 6) = "Задача" Тогда
			Мета = "Метаданные.Задачи" + Сред(СтрокаТаблХранения.Метаданные, 7);
			Если СтрокаТаблХранения.Назначение = "ТабличнаяЧасть" Тогда
				Мета = СтрЗаменить(Мета, ".ТабличнаяЧасть.", ".ТабличныеЧасти.");
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаПоляХранения.ИмяПоля) Тогда
				Поле = Вычислить(Мета + ".Реквизиты.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
			КонецЕсли;
		ИначеЕсли Лев(СтрокаТаблХранения.Метаданные, 13) = "БизнесПроцесс" Тогда
			Мета = "Метаданные.БизнесПроцесс" + Сред(СтрокаТаблХранения.Метаданные, 14);
			Если СтрокаТаблХранения.Назначение = "ТабличнаяЧасть" Тогда
				Мета = СтрЗаменить(Мета, ".ТабличнаяЧасть.", ".ТабличныеЧасти.");
			КонецЕсли;
			Если Не ПустаяСтрока(СтрокаПоляХранения.ИмяПоля) Тогда
				Поле = Вычислить(Мета + ".Реквизиты.Найти(""" + СтрокаПоляХранения.ИмяПоля + """)");
			КонецЕсли;
		КонецЕсли;
		
		Если Лев(СтрокаТаблХранения.Метаданные, 16) = "ЖурналДокументов" Тогда
			Размер 	= Предугадать(СтрокаПоляХранения.ИмяПоляХранения);
		ИначеЕсли СтрокаПоляХранения.ИмяПоляХранения = "_Number" Тогда	// Номер
			ОбъектМ = Вычислить(Мета);
			Размер 	= ?(ОбъектМ.ТипНомера=Метаданные.СвойстваОбъектов.ТипНомераДокумента.Строка, ОбъектМ.ДлинаНомера * 2, 9);
		ИначеЕсли СтрокаПоляХранения.ИмяПоляХранения = "_Description"
			Или СтрокаПоляХранения.ИмяПоляХранения = "_Name" Тогда	// Наименование
			Размер = Вычислить(Мета + ".ДлинаНаименования") * 2;
		ИначеЕсли СтрокаПоляХранения.ИмяПоляХранения = "_Code" Тогда	// Код
			ОбъектМ = Вычислить(Мета);
			Размер = ?(Лев(СтрокаТаблХранения.Метаданные, 10)="Справочник" И ОбъектМ.ТипКода=Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число, 5, ОбъектМ.ДлинаКода * 2);
		ИначеЕсли Поле=Неопределено Тогда
			Размер = Предугадать(СтрокаПоляХранения.ИмяПоляХранения);
		ИначеЕсли Строка(Поле.Тип) = "Число" Тогда
			Размер = ?(Поле.Тип.КвалификаторыЧисла.Разрядность > 9, 9, 5);
		ИначеЕсли Строка(Поле.Тип) = "Булево" Тогда
			Размер = 1;
		ИначеЕсли Строка(Поле.Тип) = "Строка" Тогда
			Размер = ?(Поле.Тип.КвалификаторыСтроки.Длина=0, 16, Поле.Тип.КвалификаторыСтроки.Длина * 2);
		ИначеЕсли Строка(Поле.Тип) = "Дата" Тогда
			Размер = 8;
		ИначеЕсли Строка(Поле.Тип) = "Хранилище значения" Тогда
			Размер = 16;
		Иначе
			Размер = Предугадать(СтрокаПоляХранения.ИмяПоляХранения);
		КонецЕсли;
	Исключение
		Размер = Предугадать(СтрокаПоляХранения.ИмяПоляХранения);
	КонецПопытки;
	Возврат Размер;
КонецФункции

Функция ДанныеБДЗаписать(Знач РазмерЗаписи, Знач ГГГГмм, Знач Количество=1, Знач ДобавлятьПринудительно=Ложь)
	тСтрока = ДанныеБД.Найти(ГГГГмм, "ГГГГММ");
	Если тСтрока = Неопределено И ДобавлятьПринудительно Тогда
		тСтрока			= ДанныеБД.Добавить();
		тСтрока.ГГГГММ	= ГГГГмм;
		тСтрока.ММ		= (ГГГГмм - Цел(ГГГГмм)) * 100;
	КонецЕсли;
	Если тСтрока <> Неопределено Тогда
		тСтрока.Количество	= тСтрока.Количество + Количество;
		тСтрока.РазмерЗаписи= тСтрока.РазмерЗаписи + Количество*РазмерЗаписи;
	КонецЕсли;
	Возврат тСтрока;
КонецФункции

Процедура ДанныеБДЗаполнить() Экспорт
	Соединение = Неопределено;
	Инициализация(Соединение);
	
	ДанныеБД.Очистить();
	Для Каждого текСтрока Из ТаблицыБД Цикл
		Если текСтрока.РазмерЗаписи < 1 Тогда
			//Продолжить;
		ИначеЕсли текСтрока.Тип = 0 Тогда
			//Продолжить;
		ИначеЕсли текСтрока.Тип < -100 Тогда
			//Продолжить;
		ИначеЕсли ФлагАДО И (текСтрока.Тип=19 Или текСтрока.Тип=15) Тогда
			Если текСтрока.Тип=15 И ФлагСправочники Тогда
				ТекстЗапроса = "SELECT _IDRRef RRef FROM dbo." + текСтрока.ИмяТаблицыХранения;
			ИначеЕсли текСтрока.Тип=19 Тогда
				ТекстЗапроса = "SELECT _NodeRRef RRef FROM dbo." + текСтрока.ИмяТаблицыХранения;
			Иначе
				Продолжить;
			КонецЕсли;
			Выборка = Запросить(ТекстЗапроса, Соединение);
			Пока Выборка <> Неопределено И Не Выборка.EOF Цикл
				ДатаСоздания = ДатаСозданияГУИД(ПолучитьGUIDизCOMSafeArray(Выборка.Fields(0).Value));
				Если Год(ДатаСоздания) > 2000 И ДатаСоздания < ТекДата Тогда
					тСтрока = ДанныеБДЗаписать(текСтрока.РазмерЗаписи, Год(ДатаСоздания) + Месяц(ДатаСоздания) * 0.01);
				КонецЕсли;
				Выборка.MoveNext();
			КонецЦикла;
			
		ИначеЕсли ФлагАДО И текСтрока.Тип < 19 Тогда
			ТекстЗапроса = "SELECT YEAR(_Period)-2000 + MONTH(_Period)*0.01 yyyymm, COUNT(1) сounter FROM dbo." + текСтрока.ИмяТаблицыХранения + " WHERE YEAR(_Period) > 2000 AND _Period <= '" + Формат(Год(ТекДата)+2000, "ЧГ=0") + Формат(ТекДата, "ДФ=MMdd") + "' GROUP BY YEAR(_Period)-2000 + MONTH(_Period)*0.01 HAVING COUNT(1) > 0 ORDER BY yyyymm";
			Если текСтрока.Тип = 2 Или текСтрока.Тип = 4 Тогда
				мСтроки = ТаблицыБД.НайтиСтроки(Новый Структура("ИмяТаблицы,Тип", Лев(текСтрока.ИмяТаблицы, СтрНайти(текСтрока.ИмяТаблицы, ".", , , 2) - 1), ?(текСтрока.Тип = 2, 1, 3)));
				Если мСтроки.Количество() > 0 Тогда
					ТекстЗапроса = "SELECT YEAR(aa._Date_Time)-2000 + MONTH(aa._Date_Time)*0.01 yyyymm, COUNT(1) сounter FROM dbo." + текСтрока.ИмяТаблицыХранения + " bb INNER JOIN dbo." + мСтроки[0].ИмяТаблицыХранения + " aa ON bb." + мСтроки[0].ИмяТаблицыХранения + "_IDRRef=aa._IDRRef WHERE YEAR(aa._Date_Time) > 2000 AND aa._Date_Time <= '" + Формат(Год(ТекДата)+2000, "ЧГ=0") + Формат(ТекДата, "ДФ=MMdd") + "' GROUP BY YEAR(aa._Date_Time)-2000 + MONTH(aa._Date_Time)*0.01 HAVING COUNT(1) > 0 ORDER BY yyyymm";
				КонецЕсли;
			ИначеЕсли текСтрока.Тип = -36 Тогда
				мСтроки = ТаблицыБД.НайтиСтроки(Новый Структура("ИмяТаблицы,Тип", Лев(текСтрока.ИмяТаблицы, СтрДлина(текСтрока.ИмяТаблицы) - 6), 6));
				Если мСтроки.Количество() > 0 Тогда
					ТекстЗапроса = "SELECT YEAR(aa._Date_Time)-2000 + MONTH(aa._Date_Time)*0.01 yyyymm, COUNT(1) сounter FROM dbo." + текСтрока.ИмяТаблицыХранения + " bb INNER JOIN dbo." + мСтроки[0].ИмяТаблицыХранения + " aa ON bb._IDRRef=aa._IDRRef WHERE YEAR(aa._Date_Time) > 2000 AND aa._Date_Time <= '" + Формат(Год(ТекДата)+2000, "ЧГ=0") + Формат(ТекДата, "ДФ=MMdd") + "' GROUP BY YEAR(aa._Date_Time)-2000 + MONTH(aa._Date_Time)*0.01 HAVING COUNT(1) > 0 ORDER BY yyyymm";
				КонецЕсли;
			ИначеЕсли текСтрока.Тип=-117 Тогда
				Если Не ФлагТехно Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли текСтрока.Тип=-18 Тогда
			ИначеЕсли текСтрока.Тип=119 Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_Period", "_Date");
			ИначеЕсли текСтрока.Тип <=6 Тогда
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_Period", "_Date_Time");
			КонецЕсли;
			Выборка = Запросить(ТекстЗапроса, Соединение);
			Пока Выборка <> Неопределено И Не Выборка.EOF Цикл
				тСтрока = ДанныеБДЗаписать(текСтрока.РазмерЗаписи, Выборка.Fields.Item(0).Value, Выборка.Fields.Item(1).Value, текСтрока.Тип <> 11);
				Выборка.MoveNext();
			КонецЦикла;
			
		ИначеЕсли текСтрока.Тип = 15 Тогда
			Если ФлагСправочники Тогда
				Выборка = Справочники[(Сред(текСтрока.ИмяТаблицы, Найти(текСтрока.ИмяТаблицы, ".") + 1))].Выбрать();
				Пока Выборка.Следующий() Цикл
					ДатаСоздания = ДатаСозданияСсылки(Выборка.Ссылка);
					Если Год(ДатаСоздания) > 2000 И ДатаСоздания < ТекДата Тогда
						тСтрока = ДанныеБДЗаписать(текСтрока.РазмерЗаписи, Год(ДатаСоздания) + Месяц(ДатаСоздания) * 0.01);
						Если тСтрока <> Неопределено Тогда
							Для Каждого тТЧ Из Выборка.Ссылка.Метаданные().ТабличныеЧасти Цикл
								тЭлемент = ТаблицыБД.Найти(текСтрока.ИмяТаблицы + "." + тТЧ.Имя, "ИмяТаблицы");
								Если тЭлемент <> Неопределено Тогда
									тСтрока.РазмерЗаписи = тСтрока.РазмерЗаписи + тЭлемент.РазмерЗаписи * Выборка[тТЧ.Имя].Количество();
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли текСтрока.Тип < 19 И СтрЧислоВхождений(текСтрока.ИмяТаблицы, ".") = 1 Тогда
			Выборка = ВыполнитьЗапрос(текСтрока);
			Если Выборка <> Неопределено Тогда
				Пока Выборка.Следующий() Цикл
					тСтрока = ДанныеБДЗаписать(текСтрока.РазмерЗаписи, Выборка.ГГГГММ, Выборка.Количество, текСтрока.Тип <> 11);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ВыполнитьЗапрос(текСтрока)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",	ТекДата);
	Если текСтрока.Тип=2 Или текСтрока.Тип=4 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГОД(Регистр54321.Ссылка.Дата) + МЕСЯЦ(Регистр54321.Ссылка.Дата) * 0.01 КАК ГГГГММ,
		               |	КОЛИЧЕСТВО(1) КАК Количество
		               |ИЗ
		               |	" + текСтрока.ИмяТаблицы + " КАК Регистр54321
		               |ГДЕ
		               |	ГОД(Регистр54321.Ссылка.Дата) > 2000 И Регистр54321.Ссылка.Дата < &Дата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГОД(Регистр54321.Ссылка.Дата) + МЕСЯЦ(Регистр54321.Ссылка.Дата) * 0.01
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(1) > 0";
	ИначеЕсли текСтрока.Тип <= 6 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГОД(Регистр54321.Дата) + МЕСЯЦ(Регистр54321.Дата) * 0.01 КАК ГГГГММ,
		               |	КОЛИЧЕСТВО(1) КАК Количество
		               |ИЗ
		               |	" + текСтрока.ИмяТаблицы + " КАК Регистр54321
		               |ГДЕ
		               |	ГОД(Регистр54321.Дата) > 2000 И Регистр54321.Дата < &Дата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГОД(Регистр54321.Дата) + МЕСЯЦ(Регистр54321.Дата) * 0.01
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(1) > 0";
	ИначеЕсли текСтрока.Тип = 9 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГОД(Регистр54321.ПериодРегистрации) + МЕСЯЦ(Регистр54321.ПериодРегистрации) * 0.01 КАК ГГГГММ,
		               |	КОЛИЧЕСТВО(1) КАК Количество
		               |ИЗ
		               |	" + текСтрока.ИмяТаблицы + " КАК Регистр54321
		               |ГДЕ
		               |	ГОД(Регистр54321.ПериодРегистрации) > 2000 И Регистр54321.ПериодРегистрации < &Дата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГОД(Регистр54321.ПериодРегистрации) + МЕСЯЦ(Регистр54321.ПериодРегистрации) * 0.01
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(1) > 0";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГОД(Регистр54321.Период) + МЕСЯЦ(Регистр54321.Период) * 0.01 КАК ГГГГММ,
		               |	КОЛИЧЕСТВО(1) КАК Количество
		               |ИЗ
		               |	" + текСтрока.ИмяТаблицы + " КАК Регистр54321
		               |ГДЕ
		               |	ГОД(Регистр54321.Период) > 2000 И Регистр54321.Период < &Дата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГОД(Регистр54321.Период) + МЕСЯЦ(Регистр54321.Период) * 0.01
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(1) > 0";
	КонецЕсли;
	Выборка = Неопределено;
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
	Исключение
		Сообщить(текСтрока.ИмяТаблицы + ": " + ОписаниеОшибки());		// чойта не то
	КонецПопытки;
	Возврат Выборка;
КонецФункции

Функция ИнфоАДОПолучить(Соединение=Неопределено) Экспорт
	Слово = "";
	Если Соединение = Неопределено Тогда
		Соединение = СоединениеПолучить();
	КонецЕсли;
	Если Соединение <> Неопределено Тогда
		Для Каждого тЭлемент Из Соединение.Properties Цикл
			Слово = Слово + тЭлемент.Name + ": " + Строка(тЭлемент.Value) + Символы.ПС;
		КонецЦикла;
	КонецЕсли;
	Возврат Слово;
КонецФункции
